atanisoft/OpenMRNIDF/src/freertos_drivers/esp32/Esp32HardwareTwai.cpp
/** \copyright
 * Copyright (c) 2021, Mike Dunston
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are  permitted provided that the following conditions are met:
 *
 *  - Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *  - Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \file Esp32HardwareTwai.cxx
 *
 * TWAI driver implementation for OpenMRN. This leverages the ESP-IDF TWAI HAL
 * API rather than the TWAI driver to allow for a more integrated solution than
 * the TWAI driver which requires polling for RX. This implementation supports
 * both ::select and the non-blocking ::ioctl/::fnctl approach.
 *
 * @author Mike Dunston
 * @date 1 May 2021
 */

// Ensure we only compile this code for the ESP32 family of MCUs and that the
// ESP-IDF version is supported for this code.
#if defined(ESP_PLATFORM)

#include "sdkconfig.h"

#if !CONFIG_IDF_TARGET_LINUX

#if CONFIG_VFS_SUPPORT_TERMIOS
// remove defines added by arduino-esp32 core/esp32/binary.h which are
// duplicated in sys/termios.h which may be included by esp_vfs.h
#undef B110
#undef B1000000
#endif // CONFIG_VFS_SUPPORT_TERMIOS

#include <assert.h>
#include <driver/gpio.h>
#include <esp_idf_version.h>

#include <esp_clk_tree.h>
#include <esp_private/periph_ctrl.h>
#ifndef CONFIG_FREERTOS_UNICORE
#include <esp_ipc.h>
#endif
#include <esp_log.h>
#include <esp_rom_gpio.h>
#include <esp_intr_alloc.h>
#include <esp_task.h>
#include <esp_vfs.h>
#include <fcntl.h>
#include <hal/twai_hal.h>
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5,5,0)
#include <hal/twai_ll.h>
#endif
#include <hal/twai_types.h>
#include <soc/gpio_sig_map.h>
#include <stdint.h>

#include "can_frame.h"
#include "can_ioctl.h"
#include "executor/Notifiable.hxx"
#include "freertos_drivers/common/DeviceBuffer.hxx"
#include "freertos_drivers/esp32/Esp32HardwareTwai.hxx"
#include "utils/Atomic.hxx"
#include "utils/logging.h"

namespace openmrn_arduino
{

/// Default file descriptor to return in the open() call.
///
/// NOTE: The TWAI driver only supports one file descriptor at this time.
static constexpr int TWAI_VFS_FD = 0;

/// Priority for the ESP32 TWAI status reporting task.
static constexpr BaseType_t WATCHDOG_TASK_PRIORITY = ESP_TASK_TCPIP_PRIO - 1;

/// Stack size (bytes) to use for the ESP32 TWAI status reporting task.
static constexpr BaseType_t WATCHDOG_TASK_STACK = 2548;

/// Interval at which to print the ESP32 TWAI bus status.
static constexpr TickType_t STATUS_PRINT_INTERVAL = pdMS_TO_TICKS(10000);

// This is only used with v5.4 or earlier, it was moved to internal as part of
// v5.5 HAL.
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5,5,0)
/// TWAI default interrupt enable mask, excludes data overrun (bit[3]) and
/// brp_div (bit[4]) since these are not supported on all models.
static constexpr uint32_t TWAI_DEFAULT_INTERRUPTS = 0xE7;
#endif //IDF v5.4 or earlier

/// TWAI Driver ISR flags.
/// Defaults to level 1-3 (C/C++ compatible) and suspend when accessing flash.
static constexpr uint32_t TWAI_INTERRUPT_FLAGS = ESP_INTR_FLAG_LOWMED;

/// ESP-IDF LOG tag used for all TWAI driver log statements.
static constexpr const char *TWAI_LOG_TAG = "ESP-TWAI";

/// TWAI Driver State
typedef struct
{
    /// TWAI Driver statistics.
    esp32_twai_stats_t stats;

    /// TWAI HAL context object.
    twai_hal_context_t context;

    /// Handle for the TWAI ISR.
    intr_handle_t isr_handle;

    /// Transmit buffer
    DeviceBuffer<struct can_frame> *tx_buf;

    /// Receive buffer
    DeviceBuffer<struct can_frame> *rx_buf;

    /// Lock protecting @ref tx_buf and @ref rx_buf.
    Atomic buf_lock;

    /// This will be notified if the device has data avilable for read.
    Notifiable* readable_notify;

    /// This will be notified if the device has buffer avilable for write.
    Notifiable* writable_notify;

    /// Flag indicating that the file descriptor has been opened with the
    /// O_NONBLOCK flag.
    bool non_blocking;

#if CONFIG_VFS_SUPPORT_SELECT
    /// Lock protecting all VFS select() cached data.
    Atomic select_lock;

    /// VFS semaphore that can be used to prematurely wakeup a call to select.
    /// NOTE: This is only valid after VFS has called @ref start_select and is
    /// invalid after VFS calls @ref end_select.
    esp_vfs_select_sem_t select_sem;

    /// Pointer to the fd_set provided by the ESP32 VFS layer used to indicate
    /// the fd is ready to be read.
    fd_set *readfds;

    /// Copy of the fd_set provided by the ESP32 VFS layer used to check if
    /// the there is a read operation pending for the fd.
    fd_set readfds_orig;

    /// Pointer to the fd_set provided by the ESP32 VFS layer used to indicate
    /// the fd is ready to be written to.
    fd_set *writefds;

    /// Copy of the fd_set provided by the ESP32 VFS layer used to check if
    /// the fd is ready to be written to.
    fd_set writefds_orig;

    /// Pointer to the fd_set provided by the ESP32 VFS layer used to indicate
    /// the fd has an error.
    fd_set *exceptfds;

    /// Copy of the fd_set provided by the ESP32 VFS layer used to check if
    /// the fd has an error.
    fd_set exceptfds_orig;
#endif // CONFIG_VFS_SUPPORT_SELECT

    /// Internal flag used for tracking if the low-level TWAI driver has been
    /// configured and ready to use.
    bool active;

