atanisoft/OpenMRNIDF/src/freertos_drivers/esp32/Esp32HardwareTwai.cpp
    /// Thread handle for the background thread that monitors the TWAI driver
    /// and periodically reports statistics.
    os_thread_t wd_thread;

    /// Internal flag used to enable the periodic printing of TWAI driver
    /// statistics.
    bool report_stats;
} TwaiDriver;

/// TWAI Driver statistics instance.
static TwaiDriver twai;

/// Helper function that will return true if the TWAI driver is currently in a
/// RUNNING state.
static inline bool is_twai_running()
{
    return twai_hal_check_state_flags(&twai.context, TWAI_HAL_STATE_FLAG_RUNNING);
}

/// Helper function that will return true if the TWAI driver is currently in a
/// RECOVERING state.
static inline bool is_twai_recovering()
{
    return twai_hal_check_state_flags(&twai.context, TWAI_HAL_STATE_FLAG_RECOVERING);
}

/// Helper function that will return true if the TWAI driver is currently in a
/// ERR-WARN state.
static inline bool is_twai_err_warn()
{
    return twai_hal_check_state_flags(&twai.context, TWAI_HAL_STATE_FLAG_ERR_WARN);
}

/// Helper function that will return true if the TWAI driver is currently in a
/// ERR-PASSIVE state.
static inline bool is_twai_err_passive()
{
    return twai_hal_check_state_flags(&twai.context, TWAI_HAL_STATE_FLAG_ERR_PASSIVE);
}

/// Helper function that will return true if the TWAI driver is currently in an
/// OFF state.
static inline bool is_twai_bus_off()
{
    return twai_hal_check_state_flags(&twai.context, TWAI_HAL_STATE_FLAG_BUS_OFF);
}

/// Helper function that will return true if the TWAI TX buffer is occupied.
static inline bool is_twai_tx_occupied()
{
    return twai_hal_check_state_flags(&twai.context, TWAI_HAL_STATE_FLAG_TX_BUFF_OCCUPIED);
}

/// Helper function that will return true if TWAI TX was successful, false otherwise.
static inline bool was_last_tx_successful()
{
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5,5,0)
    return twai_hal_check_last_tx_successful(&twai.context);
#else
    return twai_ll_get_status(twai.context.dev) & TWAI_LL_STATUS_TCS;
#endif
}

/// Helper function to start the TWAI HAL layer when it was previously stopped.
static inline void twai_restart()
{
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5,5,0)
    twai_hal_start(&twai.context, TWAI_MODE_NORMAL);
#else
    twai_hal_start(&twai.context);
#endif
}

/// Utility method for transmitting a single frame to the TWAI hardware.
///
/// @param can_frame Raw frame to be transmitted.
static inline void transmit_frame(struct can_frame *can_frame)
{
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5,5,0)
    twai_hal_frame_t hal_frame;
    twai_frame_header_t header =
    {
        .id = can_frame->can_id,
        .dlc = can_frame->can_dlc,
        .ide = IS_CAN_FRAME_EFF(*can_frame),
        .rtr = IS_CAN_FRAME_RTR(*can_frame),
    };
    twai_hal_trans_desc_t hal_trans =
    {
        .frame =
        {
            .header = &header,
            .buffer = can_frame->data,
            .buffer_len = can_frame->can_dlc,
        },
        .config =
        {
            .retry_cnt = 0,
            .loopback = 0,
        }
    };
    twai_hal_format_frame(&hal_trans, &hal_frame);
    twai_hal_set_tx_buffer_and_transmit(&twai.context, &hal_frame, 0);
#else
    twai_message_t tx_frame;
    twai_hal_frame_t hal_frame;
    memset(&tx_frame, 0, sizeof(twai_message_t));
    tx_frame.identifier = can_frame->can_id;
    tx_frame.extd = IS_CAN_FRAME_EFF(*can_frame);
    tx_frame.rtr =  IS_CAN_FRAME_RTR(*can_frame);
    tx_frame.data_length_code = can_frame->can_dlc;
    memcpy(tx_frame.data, can_frame->data, can_frame->can_dlc);
    twai_hal_format_frame(&tx_frame, &hal_frame);

    twai_hal_set_tx_buffer_and_transmit(&twai.context, &hal_frame);
#endif
}

/// Utility method for receiving a single frame from the TWAI hardware.
///
/// @param can_frame Raw frame to be received into.
/// @param frame HAL frame to be received.
static inline void receive_frame(
    struct can_frame *can_frame, twai_hal_frame_t *frame)
{
    //Set remaining bytes of data to 0
    memset(can_frame->data, 0, TWAI_FRAME_MAX_DLC);

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5,5,0)
    twai_frame_header_t header;

    memset(&header, 0, sizeof(twai_frame_header_t));
    // twai_hal_parse_frame will copy data across from the frame.
    twai_hal_parse_frame(frame, &header, can_frame->data, TWAI_FRAME_MAX_DLC);
    can_frame->can_id = header.id;
    can_frame->can_dlc = header.dlc;

    if (header.ide)
    {
        SET_CAN_FRAME_EFF(*can_frame);
    }
    else
    {
        CLR_CAN_FRAME_EFF(*can_frame);
    }

    if (header.rtr)
    {
        SET_CAN_FRAME_RTR(*can_frame);
    }
    else
    {
        CLR_CAN_FRAME_RTR(*can_frame);
    }
#else
    twai_message_t rx_frame;

    memset(&rx_frame, 0, sizeof(twai_message_t));
    twai_hal_parse_frame(frame, &rx_frame);
    memcpy(can_frame->data, rx_frame.data, TWAI_FRAME_MAX_DLC);
    can_frame->can_dlc = rx_frame.data_length_code;
    can_frame->can_id = rx_frame.identifier;

    if (rx_frame.extd)
    {
        SET_CAN_FRAME_EFF(*can_frame);
    }
    else
    {
        CLR_CAN_FRAME_EFF(*can_frame);
    }

    if (rx_frame.rtr)
    {
        SET_CAN_FRAME_RTR(*can_frame);
    }
    else
    {
        CLR_CAN_FRAME_RTR(*can_frame);
    }
#endif
}

/// Helper function that will purge the TWAI RX queue and wake the OpenMRN
/// stack if it was waiting for a frame to be ready to receive.
static inline void twai_purge_rx_queue()
{
    Notifiable* n = nullptr;
    {
        AtomicHolder h(&twai.buf_lock);
        LOG(VERBOSE, "ESP-TWAI: purging RX-Q:%zu", twai.rx_buf->pending());
        twai.stats.rx_missed += twai.rx_buf->pending();
        twai.rx_buf->flush();
        std::swap(n, twai.readable_notify);
    }
    if (n)
    {
        n->notify();
    }
#if CONFIG_VFS_SUPPORT_SELECT
    AtomicHolder l(&twai.select_lock);
    if (FD_ISSET(TWAI_VFS_FD, &twai.exceptfds_orig))
    {
        FD_SET(TWAI_VFS_FD, twai.exceptfds);
        esp_vfs_select_triggered(twai.select_sem);
    }
#endif // CONFIG_VFS_SUPPORT_SELECT
}

/// Helper function that will purge the TWAI TX queue and wake the OpenMRN
/// stack if it was waiting for TX space.
static inline void twai_purge_tx_queue()
{
    Notifiable* n = nullptr;
    {
        AtomicHolder h(&twai.buf_lock);
        LOG(VERBOSE, "ESP-TWAI: purging TX-Q:%zu", twai.tx_buf->pending());
        twai.stats.tx_lost += twai.tx_buf->pending();
        twai.tx_buf->flush();
        std::swap(n, twai.writable_notify);
    }
    if (n)
    {
        n->notify();
    }
#if CONFIG_VFS_SUPPORT_SELECT
    AtomicHolder l(&twai.select_lock);
    if (FD_ISSET(TWAI_VFS_FD, &twai.exceptfds_orig))
    {
        FD_SET(TWAI_VFS_FD, twai.exceptfds);
        esp_vfs_select_triggered(twai.select_sem);
    }
#endif // CONFIG_VFS_SUPPORT_SELECT
}

/// VFS adapter for write(fd, buf, size)
///
/// @param fd is the file descriptor being written to.
/// @param buf is the buffer containing the data to be written.
/// @param size is the size of the buffer.
/// @return number of bytes written or -1 if there is the write would be a
/// blocking operation.
static ssize_t twai_vfs_write(int fd, const void *buf, size_t size)
{
    LOG(VERBOSE, "ESP-TWAI: write(%d, %p, %zu)", fd, buf, size);
    DASSERT(fd == TWAI_VFS_FD);
    ssize_t sent = 0;
    const struct can_frame *data = (const struct can_frame *)buf;
    size /= sizeof(struct can_frame);
    bool bus_error = false;
    while (size && !bus_error)
    {
        if (is_twai_bus_off())
        {
            // If the TWAI bus is OFF initiate recovery and purge the pending TX queue.
            LOG_ERROR("ESP-TWAI: Bus is OFF, initiating recovery.");
            twai_hal_start_bus_recovery(&twai.context);
            bus_error = true;
            break;
        }
        else if (!is_twai_running())
        {
            LOG_ERROR("ESP-TWAI: TWAI driver is not running, unable to write "
                      "%zu frames.", size);
            bus_error = true;
            break;
        }
        else if (is_twai_err_passive())
        {
            // When the TWAI driver is in an error passive state it is not
            // possible to transmit additional frames, purge the TX queue and
            // track remaining frames as failed.
            //
            // NOTE: we are tracking pending remaining frames as written to
            // ensure the stack does not unnecessarily become blocked.

            sent += size;
            twai.stats.tx_lost += size;
            bus_error = true;
            break;
        }

        size_t frames_written = 0;
        {
            AtomicHolder h(&twai.buf_lock);
            frames_written = twai.tx_buf->put(data, size < 8 ? size : 8);
        }
        if (frames_written == 0)
        {
            // No space in the TX queue
            break;
        }
        else
        {
            twai.stats.tx_processed += frames_written;
        }

        if (is_twai_running() && !is_twai_tx_occupied() && frames_written)
        {
            // since the TX buffer is not occupied, retrieve the first
            // frame and transmit it here.
            AtomicHolder h(&twai.buf_lock);
            struct can_frame *frame = nullptr;
            if (twai.tx_buf->data_read_pointer(&frame) && frame != nullptr)
            {
                transmit_frame(frame);
            }
        }
        sent += frames_written;
        size -= frames_written;
    }

    if (bus_error)
    {
        twai_purge_tx_queue();
    }

    if (!sent)
    {
        errno = EWOULDBLOCK;
    }
    LOG(VERBOSE, "ESP-TWAI: write() %zu", sent * sizeof(struct can_frame));
    return sent * sizeof(struct can_frame);
}

