atanisoft/OpenMRNIDF/src/freertos_drivers/esp32/Esp32HardwareTwai.cpp
/// VFS adapter for read(fd, buf, size)
///
/// @param fd is the file descriptor being read from.
/// @param buf is the buffer to write into.
/// @param size is the size of the buffer.
/// @return number of bytes read or -1 if there is the read would be a
/// blocking operation.
static ssize_t twai_vfs_read(int fd, void *buf, size_t size)
{
    LOG(VERBOSE, "ESP-TWAI: read(%d, %p, %zu)", fd, buf, size);
    DASSERT(fd == TWAI_VFS_FD);

    ssize_t received = 0;
    struct can_frame *data = (struct can_frame *)buf;
    size /= sizeof(struct can_frame);
    while (size)
    {
        size_t received_frames = 0;
        {
            AtomicHolder h(&twai.buf_lock);
            received_frames = twai.rx_buf->get(data, size < 8 ? size : 8);
        }
        if (received_frames == 0)
        {
            break;
        }
        twai.stats.rx_processed += received_frames;
        size -= received_frames;
        received += received_frames;
        data += received_frames;
    }
    if (!received)
    {
        errno = EWOULDBLOCK;
        return -1;
    }

    LOG(VERBOSE, "ESP-TWAI: read() %zu", received * sizeof(struct can_frame));
    return received * sizeof(struct can_frame);
}

/// VFS adapter for open(path, flags, mode).
///
/// @param path is the path to the file being opened.
/// @param flags are the flags to use for opened file.
/// @param mode is the mode to use for the opened file.
///
/// When this method is invoked it will enable the TWAI driver and start the
/// periodic timer used for RX/TX of frame data.
///
/// @return 0 upon success, -1 upon failure with errno containing the cause.
static int twai_vfs_open(const char *path, int flags, int mode)
{
    // skip past the '/' that is passed in as first character
    path++;
    twai.non_blocking = (flags & O_NONBLOCK);

    LOG(VERBOSE, "ESP-TWAI: Starting TWAI driver on:%s mode:%x (%s) fd:%d",
        path, mode, twai.non_blocking ? "non-blocking" : "blocking", 
        TWAI_VFS_FD);
    twai_purge_rx_queue();
    twai_purge_tx_queue();
    twai_restart();
    return TWAI_VFS_FD;
}

/// VFS adapter for close(fd).
///
/// @param fd is the file descriptor to close.
///
/// When this method is invoked it will disable the TWAI driver and stop the
/// periodic timer used for RX/TX of frame data if it is running.
///
/// @return zero upon success, negative value with errno for failure.
static int twai_vfs_close(int fd)
{
    LOG(INFO, "ESP-TWAI: Disabling TWAI driver using fd:%d", fd);
    twai_purge_rx_queue();
    twai_purge_tx_queue();
    twai_hal_stop(&twai.context);
    return 0;
}

/// VFS adapter for ioctl.
///
/// @param fd is the file descriptor to operate on.
/// @param cmd is the command to execute.
/// @param args is the args for the command.
///
/// @return zero upon success, negative value with errno for failure.
static int twai_vfs_ioctl(int fd, int cmd, va_list args)
{
    /* sanity check to be sure we have a valid key for this device */
    HASSERT(IOC_TYPE(cmd) == CAN_IOC_MAGIC);

    // Will be called at the end if non-null.
    Notifiable* n = nullptr;

    if (IOC_SIZE(cmd) == NOTIFIABLE_TYPE)
    {
        n = reinterpret_cast<Notifiable*>(va_arg(args, uintptr_t));
    }

    switch (cmd)
    {
        default:
            return -EINVAL;
        case CAN_IOC_READ_ACTIVE:
            {
                AtomicHolder h(&twai.buf_lock);
                if (!twai.rx_buf->pending())
                {
                    std::swap(n, twai.readable_notify);
                }
            }
            break;
        case CAN_IOC_WRITE_ACTIVE:
            {
                AtomicHolder h(&twai.buf_lock);
                if (!twai.tx_buf->space())
                {
                    std::swap(n, twai.writable_notify);
                }
            }
            break;
    }
    if (n)
    {
        n->notify();
    }
    return 0;
}

/// VFS adapter for fcntl(fd, cmd, arg).
///
/// @param fd to operate on.
/// @param cmd to be executed.
/// @param arg arg to be used for the operation.
///
/// This method is currently a NO-OP.
///
/// @return zero upon success, negative value with errno for failure.
static int twai_vfs_fcntl(int fd, int cmd, int arg)
{
    HASSERT(fd == TWAI_VFS_FD);
    int result = 0;

    if (cmd == F_GETFL)
    {
        if (twai.non_blocking)
        {
            result |= O_NONBLOCK;
        }
    }
    else if (cmd == F_SETFL)
    {
        twai.non_blocking = arg & O_NONBLOCK;
    }
    else
    {
        errno = ENOSYS;
        result = -1;
    }

    return result;
}

#if CONFIG_VFS_SUPPORT_SELECT
/// VFS adapter for select()
///
/// @param nfds is the number of FDs being checked.
/// @param readfds is the set of FDs being checked for ready to read.
/// @param writefds is the set of FDs being checked for ready to write.
/// @param exceptfds is the set of FDs being checked for exception.
/// @param sem is the semaphore to use for waking up the select() call.
static esp_err_t twai_vfs_start_select(int nfds, fd_set *readfds,
                                       fd_set *writefds, fd_set *exceptfds,
                                       esp_vfs_select_sem_t sem,
                                       void **end_select_args)
{
    AtomicHolder l(&twai.select_lock);
    // zero the cached copy of the fd_sets before setting the incoming copy in
    // case the TWAI VFS FD is not set so we do not raise the alert when there
    // is an interesting event.
    FD_ZERO(&twai.readfds_orig);
    FD_ZERO(&twai.writefds_orig);
    FD_ZERO(&twai.exceptfds_orig);

    // If the TWAI FD is present in any of the FD sets we should process the
    // select call.
    if (FD_ISSET(TWAI_VFS_FD, readfds) || FD_ISSET(TWAI_VFS_FD, writefds) ||
        FD_ISSET(TWAI_VFS_FD, exceptfds))
    {
        twai.select_sem = sem;
        twai.readfds = readfds;
        twai.readfds_orig = *readfds;
        twai.writefds = writefds;
        twai.writefds_orig = *writefds;
        twai.exceptfds = exceptfds;
        twai.exceptfds_orig = *exceptfds;

        // zero the fd_sets so we can mark the correct signals when we trigger
        // the VFS layer.
        FD_ZERO(readfds);
        FD_ZERO(writefds);
        FD_ZERO(exceptfds);

