atanisoft/OpenMRNIDF/src/freertos_drivers/esp32/Esp32HardwareTwai.cpp
        // Check if we have pending frames to RX, if so trigger an early exit
        // from select()
        if (FD_ISSET(TWAI_VFS_FD, &twai.readfds_orig))
        {
            AtomicHolder h(&twai.buf_lock);
            if (twai.rx_buf->pending())
            {
                FD_SET(TWAI_VFS_FD, readfds);
                esp_vfs_select_triggered(sem);
            }
        }
    }
    return ESP_OK;
}

/// VFS interface helper invoked when select() is woken up.
///
/// @param end_select_args is any arguments provided in vfs_start_select().
static esp_err_t twai_vfs_end_select(void *end_select_args)
{
    AtomicHolder l(&twai.select_lock);
    // zero the cached copy of the fd_sets to prevent triggering the VFS wakeup
    // since the select() has ended.
    FD_ZERO(&twai.readfds_orig);
    FD_ZERO(&twai.writefds_orig);
    FD_ZERO(&twai.exceptfds_orig);
    return ESP_OK;
}

#endif // CONFIG_VFS_SUPPORT_SELECT

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5,5,0)
// this was copied from ESP-IDF v5.5.0 deletion tree, this should be replaced
// in the future through inlining this functionality to the usage place, this
// can only be done as part of desupporting v5.4.x or earlier.
static inline bool twai_hal_read_rx_buffer_and_clear(
    twai_hal_context_t *hal_ctx, twai_hal_frame_t *rx_frame)
{
#ifdef SOC_TWAI_SUPPORTS_RX_STATUS
    if (twai_ll_get_status(hal_ctx->dev) & TWAI_LL_STATUS_MS)
    {
        // Release the buffer for this particular overrun frame
        twai_ll_set_cmd_release_rx_buffer(hal_ctx->dev);
        return false;
    }
#else
    if (twai_ll_get_status(hal_ctx->dev) & TWAI_LL_STATUS_DOS)
    {
        // No need to release RX buffer as we'll be releasing all RX frames in
        // continuously later
        return false;
    }
#endif
    twai_ll_get_rx_buffer(hal_ctx->dev, rx_frame);
    twai_ll_set_cmd_release_rx_buffer(hal_ctx->dev);
    return true;
}
#endif

/// TWAI Interrupt handler for receiving one (or more) TWAI frames.
static inline uint32_t twai_rx_frames()
{
    AtomicHolder h(&twai.buf_lock);
    uint32_t rx_ready_count = twai_hal_get_rx_msg_count(&twai.context);
    struct can_frame *can_frame = nullptr;
    uint32_t rx_count = 0;
    ESP_EARLY_LOGV(TWAI_LOG_TAG, "rx-ready-count: %" PRIu32, rx_ready_count);
    for (uint32_t idx = 0; idx < rx_ready_count; idx++)
    {
        twai_hal_frame_t frame;
        if (twai_hal_read_rx_buffer_and_clear(&twai.context, &frame))
        {
            if (frame.dlc > TWAI_FRAME_MAX_DLC)
            {
                // DLC is longer than supported, discard the frame.
                twai.stats.rx_discard++;
                ESP_EARLY_LOGE(TWAI_LOG_TAG, "rx-discard:%zu",
                               twai.stats.rx_discard);
            }
            else if (twai.rx_buf->data_write_pointer(&can_frame))
            {
                receive_frame(can_frame, &frame);
                rx_count += twai.rx_buf->advance(1);
                ESP_EARLY_LOGV(TWAI_LOG_TAG, "rx-OK");
            }
            else
            {
                twai.stats.rx_missed++;
                ESP_EARLY_LOGV(TWAI_LOG_TAG, "rx-missed:%zu",
                               twai.stats.rx_missed);
            }
        }
        else
        {
            ESP_EARLY_LOGV(TWAI_LOG_TAG, "rx-overrun");
// If the SOC does not support automatic clearing of the RX FIFO we need to
// handle it here and break out of the loop.
#ifndef SOC_TWAI_SUPPORTS_RX_STATUS
            twai.stats.rx_overrun +=
                twai_hal_clear_rx_fifo_overrun(&twai.context);
            break;
#else
            twai.stats.rx_overrun++;
#endif // SOC_TWAI_SUPPORTS_RX_STATUS
        }
    }

    return rx_count;
}

/// TWAI Interrupt handler for sending a TWAI frame to the transmit buffer.
static inline uint32_t twai_tx_frame()
{
    AtomicHolder h(&twai.buf_lock);

    if (was_last_tx_successful())
    {
        ESP_EARLY_LOGV(TWAI_LOG_TAG, "TX-OK");
        twai.stats.tx_success++;
        twai.tx_buf->consume(1);
    }
    else
    {
        ESP_EARLY_LOGV(TWAI_LOG_TAG, "TX-FAIL");
        twai.stats.tx_failed++;
    }

    // Check if we have a pending frame to transmit in the queue
    struct can_frame *can_frame = nullptr;
    if (twai.tx_buf->data_read_pointer(&can_frame) && can_frame != nullptr)
    {
        transmit_frame(can_frame);
        return 1;
    }
    return 0;
}

/// Interrupt handler for the TWAI device.
///
/// @param arg unused.
static void twai_isr(void *arg)
{
    BaseType_t wakeup = pdFALSE;
    uint32_t events = twai_hal_get_events(&twai.context);
    ESP_EARLY_LOGV(TWAI_LOG_TAG, "events:%04x", events);

// These flags are only applicable for the ESP32 target
#if CONFIG_IDF_TARGET_ESP32
#if defined(CONFIG_TWAI_ERRATA_FIX_RX_FRAME_INVALID) || \
    defined(CONFIG_TWAI_ERRATA_FIX_RX_FIFO_CORRUPT)
    if (events & TWAI_HAL_EVENT_NEED_PERIPH_RESET)
    {
        ESP_EARLY_LOGV(TWAI_LOG_TAG, "periph-reset");
        twai_hal_prepare_for_reset(&twai.context);
        periph_module_reset(PERIPH_TWAI_MODULE);
        twai_hal_recover_from_reset(&twai.context);
        twai.stats.rx_lost += twai_hal_get_reset_lost_rx_cnt(&twai.context);
#if CONFIG_VFS_SUPPORT_SELECT
        AtomicHolder l(&twai.select_lock);
        if (FD_ISSET(TWAI_VFS_FD, &twai.exceptfds_orig))
        {
            FD_SET(TWAI_VFS_FD, twai.exceptfds);
            esp_vfs_select_triggered_isr(twai.select_sem, &wakeup);
        }
#endif // CONFIG_VFS_SUPPORT_SELECT
    }
#endif // TWAI_ERRATA_FIX_RX_FRAME_INVALID || TWAI_ERRATA_FIX_RX_FIFO_CORRUPT
#endif // CONFIG_IDF_TARGET_ESP32

    // RX completed
    if ((events & TWAI_HAL_EVENT_RX_BUFF_FRAME) && twai_rx_frames())
    {
#if CONFIG_VFS_SUPPORT_SELECT
        AtomicHolder l(&twai.select_lock);
        if (FD_ISSET(TWAI_VFS_FD, &twai.readfds_orig))
        {
            FD_SET(TWAI_VFS_FD, twai.readfds);
            esp_vfs_select_triggered_isr(twai.select_sem, &wakeup);
        }
#endif // CONFIG_VFS_SUPPORT_SELECT
        // std::swap is not guaranteed to be in IRAM, so it is not used here.
        if (twai.readable_notify)
        {
            twai.readable_notify->notify_from_isr();
            twai.readable_notify = nullptr;
        }
    }

    // TX completed
    if ((events & TWAI_HAL_EVENT_TX_BUFF_FREE) && twai_tx_frame())
    {
#if CONFIG_VFS_SUPPORT_SELECT
        AtomicHolder l(&twai.select_lock);
        if (FD_ISSET(TWAI_VFS_FD, &twai.writefds_orig))
        {
            FD_SET(TWAI_VFS_FD, twai.writefds);
            esp_vfs_select_triggered_isr(twai.select_sem, &wakeup);
        }
#endif // CONFIG_VFS_SUPPORT_SELECT
        // std::swap is not guaranteed to be in IRAM, so it is not used here.
        if (twai.writable_notify)
        {
            twai.writable_notify->notify_from_isr();
            twai.writable_notify = nullptr;
        }
    }

    // Bus recovery complete, trigger a restart
    if (events & TWAI_HAL_EVENT_BUS_RECOV_CPLT)
    {
        ESP_EARLY_LOGV(TWAI_LOG_TAG, "bus recovery complete");
        twai_restart();
    }

    // Bus error detected
    // NOTE: this will be raised even after entering error-passive state and
    // should be excluded from the bus_error increment accordingly.
    if (events & TWAI_HAL_EVENT_BUS_ERR && !is_twai_err_passive())
    {
        twai.stats.bus_error++;
        ESP_EARLY_LOGV(TWAI_LOG_TAG, "bus-error:%zu", twai.stats.bus_error);
    }

    // Arbitration error detected
    if (events & TWAI_HAL_EVENT_ARB_LOST)
    {
        twai.stats.arb_loss++;
        ESP_EARLY_LOGV(TWAI_LOG_TAG, "arb-loss:%zu", twai.stats.arb_loss);
    }

