atanisoft/OpenMRNIDF/src/freertos_drivers/esp32/Esp32HardwareTwai.cpp
    if (wakeup == pdTRUE)
    {
        portYIELD_FROM_ISR();
    }
}

/// Background task used for periodic reporting of TWAI bus status and bus
/// watchdog.
///
/// The watchdog feature will handle the following use cases:
/// 1) TWAI Bus status remains in Recovering state for more than one reporting
/// interval. If this occurs the task will attempt to restart bus recovery.
/// 2) RX queue does not change and at least one frame is pending RX by the
/// OpenMRN stack. If this occurs the RX queue will be drained and an attempt
/// to wake the OpenMRN stack will be performed. All pending RX frames will be
/// counted as "missed" in the status reporting.
/// 3) TX queue does not change and at least one frame is pending TX by the
/// TWAI driver. If this occurs the TX queue will be drained and an attempt
/// to wake the OpenMRN stack will be performed. All pending TX frames will be
/// counted as "fail" in the status reporting.
///
/// These use cases can occur if the CAN bus has been disconnected or there is
/// a general failure in communicating with the CAN transceiver IC.
void* twai_watchdog(void* param)
{
    LOG(VERBOSE, "ESP-TWAI: Starting TWAI watchdog and reporting task");
    size_t last_rx_pending = 0;
    size_t last_tx_pending = 0;
    size_t last_tx_success = 0;
    uint32_t last_twai_state = 0;

    while (twai.active)
    {
        // delay until the next reporting interval, this is being used instead
        // of vTaskDelay to allow early wake up in the case of shutdown of the
        // TWAI driver.
        ulTaskNotifyTake(pdTRUE, STATUS_PRINT_INTERVAL);

        // If we wake up and the TWAI driver is no longer active we should exit
        // this loop for shutdown.
        if (!twai.active)
        {
            break;
        }

        // If the last status of the bus and current status are the same and it
        // is in a recovery state, retrigger the recovery as it will remain
        // stuck indefinitely without a retrigger.
        if (last_twai_state == twai.context.state_flags &&
            is_twai_recovering())
        {
            LOG(WARNING,
                "ESP-TWAI: Bus appears to be stuck, initiating bus recovery.");
            twai_hal_start_bus_recovery(&twai.context);
        }
        last_twai_state = twai.context.state_flags;

        // If the RX queue has not changed since our last check, purge the RX
        // queue and track it as missed frames.
        if (last_rx_pending && last_rx_pending == twai.rx_buf->pending())
        {
            LOG_ERROR("ESP-TWAI: RX-Q appears stuck, purging RX-Q!");
            twai_purge_rx_queue();
        }
        last_rx_pending = twai.rx_buf->pending();

        // If the TX queue has not changed since our last check and the TX
        // success count has not changed since our last check, purge the TX
        // queue and track it as failed frames.
        if (last_tx_pending && last_tx_pending == twai.tx_buf->pending() &&
            last_tx_success && last_tx_success == twai.stats.tx_success)
        {
            LOG_ERROR("ESP-TWAI: TX-Q appears stuck, purging TX-Q!");
            twai_purge_tx_queue();
        }
        last_tx_pending = twai.tx_buf->pending();
        last_tx_success = twai.stats.tx_success;

        if (twai.report_stats)
        {
            LOG(INFO,
                "ESP-TWAI: "
                "RX:%zu (pending:%zu,overrun:%zu,discard:%zu,miss:%zu,lost:%zu) "
                "TX:%zu (pending:%zu,suc:%zu,fail:%zu,lost:%zu) "
                "Bus (arb-loss:%zu,err:%zu,state:%s)",
                twai.stats.rx_processed, twai.rx_buf->pending(),
                twai.stats.rx_overrun, twai.stats.rx_discard,
                twai.stats.rx_missed, twai.stats.rx_lost,
                twai.stats.tx_processed, twai.tx_buf->pending(),
                twai.stats.tx_success, twai.stats.tx_failed,
                twai.stats.tx_lost, twai.stats.arb_loss, twai.stats.bus_error,
                is_twai_running() ? "Running" :
                is_twai_recovering() ? "Recovering" :
                is_twai_err_warn() ? "Err-Warn" :
                is_twai_err_passive() ? "Err-Pasv" :
                "Bus Off");
        }
    }
    LOG(VERBOSE, "ESP-TWAI: Stopping TWAI watchdog and reporting task");

    return NULL;
}

Esp32HardwareTwai::Esp32HardwareTwai(
    int rx, int tx, bool report, size_t rx_size, size_t tx_size,
    const char *path, int clock_out, int bus_status, uint32_t isr_core)
    : rxPin_(rx), txPin_(tx), extClockPin_(clock_out),
    busStatusPin_(bus_status), preferredIsrCore_(isr_core), vfsPath_(path)
{
    HASSERT(GPIO_IS_VALID_GPIO(rxPin_));
    HASSERT(GPIO_IS_VALID_OUTPUT_GPIO(txPin_));

    if (extClockPin_ != GPIO_NUM_NC)
    {
        HASSERT(GPIO_IS_VALID_OUTPUT_GPIO(extClockPin_));
    }

    if (busStatusPin_ != GPIO_NUM_NC)
    {
        HASSERT(GPIO_IS_VALID_OUTPUT_GPIO(busStatusPin_));
    }

    memset(&twai.stats, 0, sizeof(esp32_twai_stats_t));

    twai.rx_buf = DeviceBuffer<struct can_frame>::create(rx_size);
    HASSERT(twai.rx_buf != nullptr);

    twai.tx_buf =
        DeviceBuffer<struct can_frame>::create(tx_size, tx_size / 2);
    HASSERT(twai.tx_buf != nullptr);

    twai.report_stats = report;
}

Esp32HardwareTwai::~Esp32HardwareTwai()
{
    if (twai.active)
    {
        esp_intr_free(twai.isr_handle);
        twai_hal_deinit(&twai.context);
    }
    twai.active = false;

    esp_vfs_unregister(vfsPath_);

    twai.tx_buf->destroy();
    twai.rx_buf->destroy();

    if (twai.wd_thread)
    {
        xTaskNotifyGive(twai.wd_thread);
    }
}

/// Internal function which is used to allocate the TWAI ISR on a specific
/// core. This will be either directly called (for single core SoCs) in
/// Esp32HardwareTwai::hw_init() or via esp_ipc.
static void esp32_twai_isr_init(void *param)
{
    LOG(VERBOSE, "ESP-TWAI: Allocating ISR");
    ESP_ERROR_CHECK(
        esp_intr_alloc(ETS_TWAI_INTR_SOURCE, TWAI_INTERRUPT_FLAGS, twai_isr,
            nullptr, &twai.isr_handle));
}

/// VFS functions to call for select() invocations.
static const esp_vfs_select_ops_t twai_select =
{
    .start_select = twai_vfs_start_select,
    .end_select = twai_vfs_end_select,
};

