atanisoft/OpenMRNIDF/src/freertos_drivers/esp32/Esp32HardwareTwai.cpp
/// VFS registration structure, these are invoked for portions of the VFS usage
/// as part of /dev/wakeup.
static const esp_vfs_fs_ops_t twai_vfs =
{
    .write = twai_vfs_write,
    .lseek = nullptr,
    .read = twai_vfs_read,
    .pread = nullptr,
    .pwrite = nullptr,
    .open = twai_vfs_open,
    .close = twai_vfs_close,
    .fstat = nullptr,
    .fcntl = twai_vfs_fcntl,
    .ioctl = twai_vfs_ioctl,
    .fsync = nullptr,
    .dir = nullptr,
#ifdef CONFIG_VFS_SUPPORT_TERMIOS
    .termios = nullptr,
#endif
#if CONFIG_VFS_SUPPORT_SELECT
    .select = &twai_select,
#endif
};

void Esp32HardwareTwai::hw_init()
{
    LOG(VERBOSE,
        "ESP-TWAI: Configuring TWAI (TX:%d, RX:%d, EXT-CLK:%d, BUS-CTRL:%d)",
        txPin_, rxPin_, extClockPin_, busStatusPin_);
    gpio_set_pull_mode((gpio_num_t)txPin_, GPIO_FLOATING);
    esp_rom_gpio_connect_out_signal(txPin_, TWAI_TX_IDX, false, false);
    esp_rom_gpio_pad_select_gpio(txPin_);

    gpio_set_pull_mode((gpio_num_t)rxPin_, GPIO_FLOATING);
    esp_rom_gpio_connect_in_signal(rxPin_, TWAI_RX_IDX, false);
    esp_rom_gpio_pad_select_gpio(rxPin_);
    gpio_set_direction((gpio_num_t)rxPin_, GPIO_MODE_INPUT);

    if (extClockPin_ != GPIO_NUM_NC)
    {
        gpio_set_pull_mode((gpio_num_t)extClockPin_, GPIO_FLOATING);
        esp_rom_gpio_connect_out_signal(extClockPin_, TWAI_CLKOUT_IDX, false,
            false);
        esp_rom_gpio_pad_select_gpio((gpio_num_t)extClockPin_);
    }

    if (busStatusPin_ != GPIO_NUM_NC)
    {
        gpio_set_pull_mode((gpio_num_t)busStatusPin_, GPIO_FLOATING);
        esp_rom_gpio_connect_out_signal(extClockPin_, TWAI_BUS_OFF_ON_IDX,
            false, false);
        esp_rom_gpio_pad_select_gpio((gpio_num_t)busStatusPin_);
    }

    ESP_ERROR_CHECK(esp_vfs_register_fs(
        vfsPath_, &twai_vfs, ESP_VFS_FLAG_STATIC, this));

// These APIs were removed in ESP-IDF v6.0.0+.
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(6,0,0)
    periph_module_reset(PERIPH_TWAI_MODULE);
    periph_module_enable(PERIPH_TWAI_MODULE);
#endif

    twai_timing_config_t timingCfg = TWAI_TIMING_CONFIG_125KBITS();
    twai_filter_config_t filterCfg = TWAI_FILTER_CONFIG_ACCEPT_ALL();

    // default clock source if not specified in config.
    if (timingCfg.clk_src == 0)
    {
        timingCfg.clk_src = TWAI_CLK_SRC_DEFAULT;
    }
    twai_hal_config_t twai_hal_cfg = 
    {
        .controller_id = 0,
        .clock_source_hz = 0,
    };

    // retrieve the clock frequency from the SoC
    esp_clk_tree_src_get_freq_hz((soc_module_clk_t)timingCfg.clk_src,
        ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED, &twai_hal_cfg.clock_source_hz);

    // BRP validations
    uint32_t brp = timingCfg.brp;
    if (timingCfg.quanta_resolution_hz)
    {
        HASSERT(twai_hal_cfg.clock_source_hz % timingCfg.quanta_resolution_hz == 0);
        brp = twai_hal_cfg.clock_source_hz / timingCfg.quanta_resolution_hz;
    }
    HASSERT(twai_ll_check_brp_validation(brp));

    // Initialize the low level HAL APIs
    HASSERT(twai_hal_init(&twai.context, &twai_hal_cfg));

    LOG(VERBOSE, "ESP-TWAI: Initiailizing peripheral");
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5,5,0)
    twai_hal_configure(&twai.context, &timingCfg, &filterCfg, 0);
#else
    twai_hal_configure(&twai.context, &timingCfg, &filterCfg,
        TWAI_DEFAULT_INTERRUPTS, 0);
#endif

#ifndef CONFIG_FREERTOS_UNICORE
    ESP_ERROR_CHECK(
        esp_ipc_call_blocking(preferredIsrCore_, esp32_twai_isr_init, nullptr));
#else
    esp32_twai_isr_init(nullptr);
#endif // CONFIG_FREERTOS_UNICORE
    twai.active = true;

    os_thread_create(&twai.wd_thread, "TWAI-WD", WATCHDOG_TASK_PRIORITY,
        WATCHDOG_TASK_STACK, twai_watchdog, this);
}

void Esp32HardwareTwai::get_driver_stats(esp32_twai_stats_t *stats)
{
    HASSERT(stats != nullptr);
    memcpy(stats, &twai.stats, sizeof(esp32_twai_stats_t));
}

} // namespace openmrn_arduino

#endif // !CONFIG_IDF_TARGET_LINUX
#endif // ESP_PLATFORM
